
#include<stdio.h>

//数组元素引用方式
	//int a[5];
	//int* p;
	//p = a;
	// (1)a[2]=100;
	//(2)p[2] = 100;//相当于a[2]=100
	//补充：c语言规定，数组的名字就是数组的首地址，即第0个元素的地址就是&a[0],a是个常量
	//(3)*(p + 2) = 100;相当于a[2]=100
	//解释p是第0个元素的地址，(p+2)是a[2]这个元素的地址
	//(4)*(a + 2) = 100;相当于a[2]=100
int pointer02()
{
	int a[5] = {1,2,3,4,5};
	int* p;
	p = a;
	printf("a[2]=%d\n",a[2]);
	printf("p[2]=%d\n",p[2]);
	printf("*(p+2)=%d\n", *(p + 2));
	printf("*(a+2)=%d\n", *(a + 2));
	printf("p=%p\n", p);
	printf("p+2=%p\n", p + 2);//+1增加4个字节
	return 0;
}